In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [29]:
np.random.seed(1)

In [30]:
data = np.random.randint(30,101, size=(4,6) )
data

array([[67, 42, 39, 35, 94, 46],
       [31, 36, 55, 80, 50, 48],
       [41, 58, 59, 44, 80, 98],
       [43, 39, 37, 93, 91, 52]])

In [37]:
df = pd.DataFrame( data )
df

    0   1   2   3   4   5
0  67  42  39  35  94  46
1  31  36  55  80  50  48
2  41  58  59  44  80  98
3  43  39  37  93  91  52

In [32]:
df['년도'] = [2018,2018,2019,2019]
df['반'] = ['1반','2반','1반','2반']
df

    0   1   2   3   4   5    년도   반
0  67  42  39  35  94  46  2018  1반
1  31  36  55  80  50  48  2018  2반
2  41  58  59  44  80  98  2019  1반
3  43  39  37  93  91  52  2019  2반

In [33]:
df.set_index( ['년도','반'] )

          0   1   2   3   4   5
년도   반
2018 1반  67  42  39  35  94  46
     2반  31  36  55  80  50  48
2019 1반  41  58  59  44  80  98
     2반  43  39  37  93  91  52

In [34]:
df

    0   1   2   3   4   5    년도   반
0  67  42  39  35  94  46  2018  1반
1  31  36  55  80  50  48  2018  2반
2  41  58  59  44  80  98  2019  1반
3  43  39  37  93  91  52  2019  2반

In [38]:
df.index = pd.MultiIndex.from_product( [[2018,2019],['1반','2반'] ], names=['년도','반']  )

In [39]:
df

          0   1   2   3   4   5
년도   반
2018 1반  67  42  39  35  94  46
     2반  31  36  55  80  50  48
2019 1반  41  58  59  44  80  98
     2반  43  39  37  93  91  52

In [9]:
df.index

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

In [10]:
df.index.levels[0]

Int64Index([2018, 2019], dtype='int64', name='년도')

In [11]:
df.index.levels[1]

Index(['1반', '2반'], dtype='object', name='반')

In [16]:
df.index.get_level_values(0)

Int64Index([2018, 2018, 2019, 2019], dtype='int64', name='년도')

In [17]:
df.index.get_level_values(1)

Index(['1반', '2반', '1반', '2반'], dtype='object', name='반')

In [18]:
df.columns = pd.MultiIndex.from_product( [['홍길동','이순신','임꺽정'],
                                        ['국어','영어'] ]  )

In [19]:
df

        홍길동     이순신     임꺽정
         국어  영어  국어  영어  국어  영어
년도   반
2018 1반  67  42  39  35  94  46
     2반  31  36  55  80  50  48
2019 1반  41  58  59  44  80  98
     2반  43  39  37  93  91  52

In [27]:
df.loc[2018].loc['1반']

홍길동  국어    67
     영어    42
이순신  국어    39
     영어    35
임꺽정  국어    94
     영어    46
Name: 1반, dtype: int32

In [26]:
df['홍길동']['국어']

년도    반
2018  1반    67
      2반    31
2019  1반    41
      2반    43
Name: 국어, dtype: int32

In [12]:

1. https://movie.daum.net/ranking/reservation 를 파싱하여 아래처럼 출력하시요

	영화명	평점		개봉일
=======================	
겨울왕국 2	7.6 	2019.11.21 개봉
나를 찾아줘	7.0	2019.11.27 개봉
...
어메이징그레이스	9.0	2019.11.28 개봉

2. 위의 결과를 데이터프레임으로 변환후 평점이 8.0 이상인 
영화명 평점 개봉일을 출력하시요

3. x축을 영화명 으로 y축을 평점으로 라인차트를 그리시요

4. 2021년02월 01일 이후 개봉한 영화명,평점,개봉일을 구하시요

SyntaxError: invalid syntax (<ipython-input-12-c1f9475b2dcc>, line 1)

In [ ]:
1. 3개의 데이터를 병합하시요. 2014sleep.csv 2015sleep.csv 2016sleep.csv
====이후문제는 병합한 데이터프레임을 이용 ===========
2. 년도, 월별로 인덱스를 설정(멀티인덱스) 하고
데이터를 보여 주시요

3. 년도 및 월별 평균 사망자를 보여주시요

4.  2016년 사고대비 사망율을 구하시요

5. 2014년도 월별 사망, 부상 데이터를 바차트로
보여주시요

6. 2015년 대비  사망이 가장 많이 증가한
2016년 도 월을 구하시요

In [ ]:
from bs4 import BeautifulSoup
import urllib.request as REQ
import pandas as pd
import numpy as np
from datetime import datetime 
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [ ]:
# murl='https://movie.daum.net/premovie/released'
murl = 'https://movie.daum.net/ranking/reservation'
response = REQ.urlopen(murl)
soup = BeautifulSoup(response, 'html.parser')
soup